Revit 2024 API
AnalysisDisplayDeformedShapeSettings Members
The AnalysisDisplayDeformedShapeSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayDeformedShapeSettings()
 Constructs a default instance of deformed shape settings.
AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings)
 Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayDeformedShapeSettings
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Compares two deformed shape settings objects.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
GridColor
 Color of grid lines.
GridLineWeight
 Line weight of grid lines.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Rounding
 Increment to which numeric values of analysis results are rounded in deformed shape.
ShowContourLines
 If true, show contour lines in the analysis display.
ShowGridLines
 If true, show grid lines in the analysis display.
TextLabelType
 Type of deformed shape text visualization.
TextTypeId
 Element id of text associated with the settings.
Transparency
 Transparency percentage of deformed shape color fill on surfaces
See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace